hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_femc_regs.h
/* Bitfield definition for register: BYTEMSK */
/*
 * BM3 (RW)
 *
 * Byte Mask for Byte 3 (IPTXD bit 31:24)
 * 0b - Byte Unmasked
 * 1b - Byte Masked
 */
#define FEMC_BYTEMSK_BM3_MASK (0x8U)
#define FEMC_BYTEMSK_BM3_SHIFT (3U)
#define FEMC_BYTEMSK_BM3_SET(x) (((uint32_t)(x) << FEMC_BYTEMSK_BM3_SHIFT) & FEMC_BYTEMSK_BM3_MASK)
#define FEMC_BYTEMSK_BM3_GET(x) (((uint32_t)(x) & FEMC_BYTEMSK_BM3_MASK) >> FEMC_BYTEMSK_BM3_SHIFT)

/*
 * BM2 (RW)
 *
 * Byte Mask for Byte 2 (IPTXD bit 23:16)
 * 0b - Byte Unmasked
 * 1b - Byte Masked
 */
#define FEMC_BYTEMSK_BM2_MASK (0x4U)
#define FEMC_BYTEMSK_BM2_SHIFT (2U)
#define FEMC_BYTEMSK_BM2_SET(x) (((uint32_t)(x) << FEMC_BYTEMSK_BM2_SHIFT) & FEMC_BYTEMSK_BM2_MASK)
#define FEMC_BYTEMSK_BM2_GET(x) (((uint32_t)(x) & FEMC_BYTEMSK_BM2_MASK) >> FEMC_BYTEMSK_BM2_SHIFT)

/*
 * BM1 (RW)
 *
 * Byte Mask for Byte 1 (IPTXD bit 15:8)
 * 0b - Byte Unmasked
 * 1b - Byte Masked
 */
#define FEMC_BYTEMSK_BM1_MASK (0x2U)
#define FEMC_BYTEMSK_BM1_SHIFT (1U)
#define FEMC_BYTEMSK_BM1_SET(x) (((uint32_t)(x) << FEMC_BYTEMSK_BM1_SHIFT) & FEMC_BYTEMSK_BM1_MASK)
#define FEMC_BYTEMSK_BM1_GET(x) (((uint32_t)(x) & FEMC_BYTEMSK_BM1_MASK) >> FEMC_BYTEMSK_BM1_SHIFT)

/*
 * BM0 (RW)
 *
 * Byte Mask for Byte 0 (IPTXD bit 7:0)
 * 0b - Byte Unmasked
 * 1b - Byte Masked
 */
#define FEMC_BYTEMSK_BM0_MASK (0x1U)
#define FEMC_BYTEMSK_BM0_SHIFT (0U)
#define FEMC_BYTEMSK_BM0_SET(x) (((uint32_t)(x) << FEMC_BYTEMSK_BM0_SHIFT) & FEMC_BYTEMSK_BM0_MASK)
#define FEMC_BYTEMSK_BM0_GET(x) (((uint32_t)(x) & FEMC_BYTEMSK_BM0_MASK) >> FEMC_BYTEMSK_BM0_SHIFT)

/* Bitfield definition for register: IPCMD */
/*
 * KEY (WO)
 *
 * This field should be written with 0x5AA5 when trigging an IP command for all device types. The memory
 * device is selected by BRx settings and IPCR0 registers.
 */
#define FEMC_IPCMD_KEY_MASK (0xFFFF0000UL)
#define FEMC_IPCMD_KEY_SHIFT (16U)
#define FEMC_IPCMD_KEY_SET(x) (((uint32_t)(x) << FEMC_IPCMD_KEY_SHIFT) & FEMC_IPCMD_KEY_MASK)
#define FEMC_IPCMD_KEY_GET(x) (((uint32_t)(x) & FEMC_IPCMD_KEY_MASK) >> FEMC_IPCMD_KEY_SHIFT)

/*
 * CMD (RW)
 *
 * SDRAM Commands:
 * • 0x8: READ
 * • 0x9: WRITE
 * • 0xA: MODESET
 * • 0xB: ACTIVE
 * • 0xC: AUTO REFRESH
 * • 0xD: SELF REFRESH
 * • 0xE: PRECHARGE
 * • 0xF: PRECHARGE ALL
 * • Others: RSVD
 * NOTE: SELF REFRESH is sent to all SDRAM devices because they shared same CLK pin.
 */
#define FEMC_IPCMD_CMD_MASK (0xFFFFU)
#define FEMC_IPCMD_CMD_SHIFT (0U)
#define FEMC_IPCMD_CMD_SET(x) (((uint32_t)(x) << FEMC_IPCMD_CMD_SHIFT) & FEMC_IPCMD_CMD_MASK)
#define FEMC_IPCMD_CMD_GET(x) (((uint32_t)(x) & FEMC_IPCMD_CMD_MASK) >> FEMC_IPCMD_CMD_SHIFT)

/* Bitfield definition for register: IPTX */
/*
 * DAT (RW)
 *
 * Data
 */
#define FEMC_IPTX_DAT_MASK (0xFFFFFFFFUL)
#define FEMC_IPTX_DAT_SHIFT (0U)
#define FEMC_IPTX_DAT_SET(x) (((uint32_t)(x) << FEMC_IPTX_DAT_SHIFT) & FEMC_IPTX_DAT_MASK)
#define FEMC_IPTX_DAT_GET(x) (((uint32_t)(x) & FEMC_IPTX_DAT_MASK) >> FEMC_IPTX_DAT_SHIFT)

/* Bitfield definition for register: IPRX */
/*
 * DAT (RW)
 *
 * Data
 */
#define FEMC_IPRX_DAT_MASK (0xFFFFFFFFUL)
#define FEMC_IPRX_DAT_SHIFT (0U)
#define FEMC_IPRX_DAT_SET(x) (((uint32_t)(x) << FEMC_IPRX_DAT_SHIFT) & FEMC_IPRX_DAT_MASK)
#define FEMC_IPRX_DAT_GET(x) (((uint32_t)(x) & FEMC_IPRX_DAT_MASK) >> FEMC_IPRX_DAT_SHIFT)

/* Bitfield definition for register: STAT0 */
/*
 * IDLE (RO)
 *
 * Indicating whether it is in IDLE state.
 * When IDLE=1, it is in IDLE state. There is no pending AXI command in internal queue and no
 * pending device access.
 */
#define FEMC_STAT0_IDLE_MASK (0x1U)
#define FEMC_STAT0_IDLE_SHIFT (0U)
#define FEMC_STAT0_IDLE_GET(x) (((uint32_t)(x) & FEMC_STAT0_IDLE_MASK) >> FEMC_STAT0_IDLE_SHIFT)

/* Bitfield definition for register array: BR2 */
/*
 * BASE (RW)
 *
 * Base Address
 * This field determines high position 20 bits of SoC level Base Address. SoC level Base Address low
 * position 12 bits are all zero.
 */
#define FEMC_BR2_BASE_MASK (0xFFFFF000UL)
#define FEMC_BR2_BASE_SHIFT (12U)
#define FEMC_BR2_BASE_SET(x) (((uint32_t)(x) << FEMC_BR2_BASE_SHIFT) & FEMC_BR2_BASE_MASK)
#define FEMC_BR2_BASE_GET(x) (((uint32_t)(x) & FEMC_BR2_BASE_MASK) >> FEMC_BR2_BASE_SHIFT)

/*
 * SIZE (RW)
 *
 * Memory size
 * 00000b - 4KB
 * 00001b - 8KB
 * 00010b - 16KB
 * 00011b - 32KB
 * 00100b - 64KB
 * 00101b - 128KB
 * 00110b - 256KB
 * 00111b - 512KB
 * 01000b - 1MB
 * 01001b - 2MB
 * 01010b - 4MB
 * 01011b - 8MB
 * 01100b - 16MB
 * 01101b - 32MB
 * 01110b - 64MB
 * 01111b - 128MB
 * 10000b - 256MB
 * 10001b - 512MB
 * 10010b - 1GB
 * 10011b - 2GB
 * 10100-11111b - 4GB
 */
#define FEMC_BR2_SIZE_MASK (0x3EU)
#define FEMC_BR2_SIZE_SHIFT (1U)
#define FEMC_BR2_SIZE_SET(x) (((uint32_t)(x) << FEMC_BR2_SIZE_SHIFT) & FEMC_BR2_SIZE_MASK)
#define FEMC_BR2_SIZE_GET(x) (((uint32_t)(x) & FEMC_BR2_SIZE_MASK) >> FEMC_BR2_SIZE_SHIFT)

/*
 * VLD (RW)
 *
 * Valid
 */
#define FEMC_BR2_VLD_MASK (0x1U)
#define FEMC_BR2_VLD_SHIFT (0U)
#define FEMC_BR2_VLD_SET(x) (((uint32_t)(x) << FEMC_BR2_VLD_SHIFT) & FEMC_BR2_VLD_MASK)
#define FEMC_BR2_VLD_GET(x) (((uint32_t)(x) & FEMC_BR2_VLD_MASK) >> FEMC_BR2_VLD_SHIFT)

/* Bitfield definition for register: SRCTRL2 */
/*
 * ADVH (RW)
 *
 * ADV hold state
 * 0b - ADV is high during address hold state
 * 1b - ADV is low during address hold state
 */
#define FEMC_SRCTRL2_ADVH_MASK (0x800U)
#define FEMC_SRCTRL2_ADVH_SHIFT (11U)
#define FEMC_SRCTRL2_ADVH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL2_ADVH_SHIFT) & FEMC_SRCTRL2_ADVH_MASK)
#define FEMC_SRCTRL2_ADVH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL2_ADVH_MASK) >> FEMC_SRCTRL2_ADVH_SHIFT)

/*
 * ADVP (RW)
 *
 * ADV polarity
 * 0b - ADV is active low
 * 1b - ADV is active high
 */
#define FEMC_SRCTRL2_ADVP_MASK (0x400U)
#define FEMC_SRCTRL2_ADVP_SHIFT (10U)
#define FEMC_SRCTRL2_ADVP_SET(x) (((uint32_t)(x) << FEMC_SRCTRL2_ADVP_SHIFT) & FEMC_SRCTRL2_ADVP_MASK)
#define FEMC_SRCTRL2_ADVP_GET(x) (((uint32_t)(x) & FEMC_SRCTRL2_ADVP_MASK) >> FEMC_SRCTRL2_ADVP_SHIFT)

/*
 * ADM (RW)
 *
 * address data mode
 * 00b - address and data MUX mode
 * 11b - address and data non-MUX mode
 */
#define FEMC_SRCTRL2_ADM_MASK (0x300U)
#define FEMC_SRCTRL2_ADM_SHIFT (8U)
#define FEMC_SRCTRL2_ADM_SET(x) (((uint32_t)(x) << FEMC_SRCTRL2_ADM_SHIFT) & FEMC_SRCTRL2_ADM_MASK)
#define FEMC_SRCTRL2_ADM_GET(x) (((uint32_t)(x) & FEMC_SRCTRL2_ADM_MASK) >> FEMC_SRCTRL2_ADM_SHIFT)

