hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_femc_regs.h
/*
 * PORTSZ (RW)
 *
 * port size
 * 0b - 8bit
 * 1b - 16bit
 */
#define FEMC_SRCTRL2_PORTSZ_MASK (0x1U)
#define FEMC_SRCTRL2_PORTSZ_SHIFT (0U)
#define FEMC_SRCTRL2_PORTSZ_SET(x) (((uint32_t)(x) << FEMC_SRCTRL2_PORTSZ_SHIFT) & FEMC_SRCTRL2_PORTSZ_MASK)
#define FEMC_SRCTRL2_PORTSZ_GET(x) (((uint32_t)(x) & FEMC_SRCTRL2_PORTSZ_MASK) >> FEMC_SRCTRL2_PORTSZ_SHIFT)

/* Bitfield definition for register: SRCTRL3 */
/*
 * OEH (RW)
 *
 * OE high time, is OEH+1 clock cycles
 */
#define FEMC_SRCTRL3_OEH_MASK (0xF0000000UL)
#define FEMC_SRCTRL3_OEH_SHIFT (28U)
#define FEMC_SRCTRL3_OEH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_OEH_SHIFT) & FEMC_SRCTRL3_OEH_MASK)
#define FEMC_SRCTRL3_OEH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_OEH_MASK) >> FEMC_SRCTRL3_OEH_SHIFT)

/*
 * OEL (RW)
 *
 * OE low time, is OEL+1 clock cycles
 */
#define FEMC_SRCTRL3_OEL_MASK (0xF000000UL)
#define FEMC_SRCTRL3_OEL_SHIFT (24U)
#define FEMC_SRCTRL3_OEL_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_OEL_SHIFT) & FEMC_SRCTRL3_OEL_MASK)
#define FEMC_SRCTRL3_OEL_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_OEL_MASK) >> FEMC_SRCTRL3_OEL_SHIFT)

/*
 * WEH (RW)
 *
 * WE high time, is WEH+1 clock cycles
 */
#define FEMC_SRCTRL3_WEH_MASK (0xF00000UL)
#define FEMC_SRCTRL3_WEH_SHIFT (20U)
#define FEMC_SRCTRL3_WEH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_WEH_SHIFT) & FEMC_SRCTRL3_WEH_MASK)
#define FEMC_SRCTRL3_WEH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_WEH_MASK) >> FEMC_SRCTRL3_WEH_SHIFT)

/*
 * WEL (RW)
 *
 * WE low time, is WEL+1 clock cycles
 */
#define FEMC_SRCTRL3_WEL_MASK (0xF0000UL)
#define FEMC_SRCTRL3_WEL_SHIFT (16U)
#define FEMC_SRCTRL3_WEL_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_WEL_SHIFT) & FEMC_SRCTRL3_WEL_MASK)
#define FEMC_SRCTRL3_WEL_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_WEL_MASK) >> FEMC_SRCTRL3_WEL_SHIFT)

/*
 * AH (RW)
 *
 * Address hold time, is AH+1 clock cycles
 */
#define FEMC_SRCTRL3_AH_MASK (0xF000U)
#define FEMC_SRCTRL3_AH_SHIFT (12U)
#define FEMC_SRCTRL3_AH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_AH_SHIFT) & FEMC_SRCTRL3_AH_MASK)
#define FEMC_SRCTRL3_AH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_AH_MASK) >> FEMC_SRCTRL3_AH_SHIFT)

/*
 * AS (RW)
 *
 * Address setup time, is AS+1 clock cycles
 */
#define FEMC_SRCTRL3_AS_MASK (0xF00U)
#define FEMC_SRCTRL3_AS_SHIFT (8U)
#define FEMC_SRCTRL3_AS_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_AS_SHIFT) & FEMC_SRCTRL3_AS_MASK)
#define FEMC_SRCTRL3_AS_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_AS_MASK) >> FEMC_SRCTRL3_AS_SHIFT)

/*
 * CEH (RW)
 *
 * Chip enable hold time, is CEH+1 clock cycles
 */
#define FEMC_SRCTRL3_CEH_MASK (0xF0U)
#define FEMC_SRCTRL3_CEH_SHIFT (4U)
#define FEMC_SRCTRL3_CEH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_CEH_SHIFT) & FEMC_SRCTRL3_CEH_MASK)
#define FEMC_SRCTRL3_CEH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_CEH_MASK) >> FEMC_SRCTRL3_CEH_SHIFT)

/*
 * CES (RW)
 *
 * Chip enable setup time, is CES+1 clock cycles
 */
#define FEMC_SRCTRL3_CES_MASK (0xFU)
#define FEMC_SRCTRL3_CES_SHIFT (0U)
#define FEMC_SRCTRL3_CES_SET(x) (((uint32_t)(x) << FEMC_SRCTRL3_CES_SHIFT) & FEMC_SRCTRL3_CES_MASK)
#define FEMC_SRCTRL3_CES_GET(x) (((uint32_t)(x) & FEMC_SRCTRL3_CES_MASK) >> FEMC_SRCTRL3_CES_SHIFT)

/* Bitfield definition for register: DLYCFG */
/*
 * OE (RW)
 *
 * delay clock output enable, should be set after setting DLYEN and DLYSEL
 */
#define FEMC_DLYCFG_OE_MASK (0x2000U)
#define FEMC_DLYCFG_OE_SHIFT (13U)
#define FEMC_DLYCFG_OE_SET(x) (((uint32_t)(x) << FEMC_DLYCFG_OE_SHIFT) & FEMC_DLYCFG_OE_MASK)
#define FEMC_DLYCFG_OE_GET(x) (((uint32_t)(x) & FEMC_DLYCFG_OE_MASK) >> FEMC_DLYCFG_OE_SHIFT)

/*
 * DLYSEL (RW)
 *
 * delay line select, 0 for 1 cell, 31 for all 32 cells
 */
#define FEMC_DLYCFG_DLYSEL_MASK (0x3EU)
#define FEMC_DLYCFG_DLYSEL_SHIFT (1U)
#define FEMC_DLYCFG_DLYSEL_SET(x) (((uint32_t)(x) << FEMC_DLYCFG_DLYSEL_SHIFT) & FEMC_DLYCFG_DLYSEL_MASK)
#define FEMC_DLYCFG_DLYSEL_GET(x) (((uint32_t)(x) & FEMC_DLYCFG_DLYSEL_MASK) >> FEMC_DLYCFG_DLYSEL_SHIFT)

/*
 * DLYEN (RW)
 *
 * delay line enable
 */
#define FEMC_DLYCFG_DLYEN_MASK (0x1U)
#define FEMC_DLYCFG_DLYEN_SHIFT (0U)
#define FEMC_DLYCFG_DLYEN_SET(x) (((uint32_t)(x) << FEMC_DLYCFG_DLYEN_SHIFT) & FEMC_DLYCFG_DLYEN_MASK)
#define FEMC_DLYCFG_DLYEN_GET(x) (((uint32_t)(x) & FEMC_DLYCFG_DLYEN_MASK) >> FEMC_DLYCFG_DLYEN_SHIFT)



/* BR register group index macro definition */
#define FEMC_BR_BASE0 (0UL)
#define FEMC_BR_BASE1 (1UL)
#define FEMC_BR_BASE6 (6UL)

/* BR2 register group index macro definition */
#define FEMC_BR2_BASE0 (0UL)
#define FEMC_BR2_BASE1 (1UL)


#endif /* HPM_FEMC_H */
